experiments/workflow/boki-movie/expected_results/qps100/wrk.log
Running 2m test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.862ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.896ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  291.42us   1.63ms   60.52%
    Req/Sec    52.04     51.80   111.00     84.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.98ms
 75.000%    1.27ms
 90.000%    1.39ms
 99.000%    1.51ms
 99.900%    1.57ms
 99.990%    1.61ms
 99.999%    1.63ms
100.000%    1.63ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.247     0.000000            1         1.00
       0.606     0.100000         1400         1.11
       0.740     0.200000         2808         1.25
       0.816     0.300000         4210         1.43
       0.886     0.400000         5612         1.67
       0.983     0.500000         7007         2.00
       1.042     0.550000         7705         2.22
       1.105     0.600000         8406         2.50
       1.172     0.650000         9107         2.86
       1.227     0.700000         9806         3.33
       1.271     0.750000        10514         4.00
       1.292     0.775000        10859         4.44
       1.310     0.800000        11203         5.00
       1.330     0.825000        11561         5.71
       1.347     0.850000        11904         6.67
       1.367     0.875000        12252         8.00
       1.378     0.887500        12432         8.89
       1.389     0.900000        12608        10.00
       1.399     0.912500        12786        11.43
       1.409     0.925000        12959        13.33
       1.423     0.937500        13131        16.00
       1.429     0.943750        13216        17.78
       1.436     0.950000        13305        20.00
       1.444     0.956250        13389        22.86
       1.453     0.962500        13475        26.67
       1.462     0.968750        13564        32.00
       1.467     0.971875        13610        35.56
       1.473     0.975000        13649        40.00
       1.480     0.978125        13693        45.71
       1.487     0.981250        13736        53.33
       1.494     0.984375        13785        64.00
       1.498     0.985938        13803        71.11
       1.504     0.987500        13829        80.00
       1.507     0.989062        13846        91.43
       1.512     0.990625        13867       106.67
       1.519     0.992188        13889       128.00
       1.522     0.992969        13900       142.22
       1.526     0.993750        13913       160.00
       1.528     0.994531        13922       182.86
       1.536     0.995313        13934       213.33
       1.541     0.996094        13947       256.00
       1.542     0.996484        13950       284.44
       1.546     0.996875        13955       320.00
       1.550     0.997266        13962       365.71
       1.553     0.997656        13966       426.67
       1.558     0.998047        13971       512.00
       1.559     0.998242        13974       568.89
       1.560     0.998437        13978       640.00
       1.562     0.998633        13981       731.43
       1.563     0.998828        13982       853.33
       1.566     0.999023        13985      1024.00
       1.569     0.999121        13986      1137.78
       1.577     0.999219        13988      1280.00
       1.578     0.999316        13989      1462.86
       1.579     0.999414        13990      1706.67
       1.589     0.999512        13993      2048.00
       1.589     0.999561        13993      2275.56
       1.589     0.999609        13993      2560.00
       1.593     0.999658        13994      2925.71
       1.593     0.999707        13994      3413.33
       1.594     0.999756        13995      4096.00
       1.594     0.999780        13995      4551.11
       1.598     0.999805        13996      5120.00
       1.598     0.999829        13996      5851.43
       1.598     0.999854        13996      6826.67
       1.607     0.999878        13997      8192.00
       1.607     0.999890        13997      9102.22
       1.607     0.999902        13997     10240.00
       1.607     0.999915        13997     11702.86
       1.607     0.999927        13997     13653.33
       1.635     0.999939        13998     16384.00
       1.635     1.000000        13998          inf
#[Mean    =        1.003, StdDeviation   =        0.291]
#[Max     =        1.635, Total count    =        13998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  202.00us
 75.000%  227.00us
 90.000%  257.00us
 99.000%  293.00us
 99.900%  311.00us
 99.990%  323.00us
 99.999%  336.00us
100.000%  336.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.148     0.000000            1         1.00
       0.176     0.100000         1402         1.11
       0.184     0.200000         2966         1.25
       0.190     0.300000         4274         1.43
       0.196     0.400000         5680         1.67
       0.202     0.500000         7115         2.00
       0.205     0.550000         7767         2.22
       0.209     0.600000         8462         2.50
       0.214     0.650000         9201         2.86
       0.219     0.700000         9821         3.33
       0.227     0.750000        10526         4.00
       0.231     0.775000        10892         4.44
       0.235     0.800000        11231         5.00
       0.240     0.825000        11607         5.71
       0.245     0.850000        11962         6.67
       0.251     0.875000        12293         8.00
       0.254     0.887500        12471         8.89
       0.257     0.900000        12652        10.00
       0.260     0.912500        12811        11.43
       0.264     0.925000        12976        13.33
       0.268     0.937500        13160        16.00
       0.270     0.943750        13229        17.78
       0.272     0.950000        13302        20.00
       0.275     0.956250        13400        22.86
       0.278     0.962500        13512        26.67
       0.280     0.968750        13571        32.00
       0.281     0.971875        13607        35.56
       0.283     0.975000        13660        40.00
       0.285     0.978125        13701        45.71
       0.287     0.981250        13744        53.33
       0.289     0.984375        13793        64.00
       0.290     0.985938        13810        71.11
       0.292     0.987500        13839        80.00
       0.293     0.989062        13864        91.43
       0.294     0.990625        13872       106.67
       0.296     0.992188        13892       128.00
       0.297     0.992969        13900       142.22
       0.298     0.993750        13915       160.00
       0.299     0.994531        13924       182.86
       0.301     0.995313        13943       213.33
       0.302     0.996094        13953       256.00
       0.302     0.996484        13953       284.44
       0.303     0.996875        13959       320.00
       0.304     0.997266        13964       365.71
       0.305     0.997656        13968       426.67
       0.306     0.998047        13973       512.00
       0.307     0.998242        13977       568.89
       0.307     0.998437        13977       640.00
       0.309     0.998633        13981       731.43
       0.310     0.998828        13983       853.33
       0.311     0.999023        13986      1024.00
       0.311     0.999121        13986      1137.78
       0.312     0.999219        13988      1280.00
       0.313     0.999316        13990      1462.86
       0.313     0.999414        13990      1706.67
       0.315     0.999512        13992      2048.00
       0.315     0.999561        13992      2275.56
       0.317     0.999609        13993      2560.00
       0.318     0.999658        13994      2925.71
       0.318     0.999707        13994      3413.33
       0.323     0.999756        13997      4096.00
       0.323     0.999780        13997      4551.11
       0.323     0.999805        13997      5120.00
       0.323     0.999829        13997      5851.43
       0.323     0.999854        13997      6826.67
       0.323     0.999878        13997      8192.00
       0.323     0.999890        13997      9102.22
       0.323     0.999902        13997     10240.00
       0.323     0.999915        13997     11702.86
       0.323     0.999927        13997     13653.33
       0.336     0.999939        13998     16384.00
       0.336     1.000000        13998          inf
#[Mean    =        0.210, StdDeviation   =        0.031]
#[Max     =        0.336, Total count    =        13998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15002 requests in 2.50m, 2.33MB read
Requests/sec:    100.01
Transfer/sec:     15.92KB