experiments/workflow/boki-movie/expected_results/qps100/wrk_warmup.log
Running 30s test @ http://ip-172-31-6-74.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 6.965ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 3.739ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.40ms   10.32ms  44.96ms   89.69%
    Req/Sec    51.64     52.29   333.00     89.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.04ms
 75.000%    1.29ms
 90.000%   21.23ms
 99.000%   44.99ms
 99.900%   44.99ms
 99.990%   44.99ms
 99.999%   44.99ms
100.000%   44.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.379     0.000000            1         1.00
       0.572     0.100000          201         1.11
       0.661     0.200000          401         1.25
       0.773     0.300000          600         1.43
       0.912     0.400000          800         1.67
       1.041     0.500000          999         2.00
       1.092     0.550000         1102         2.22
       1.136     0.600000         1202         2.50
       1.182     0.650000         1300         2.86
       1.226     0.700000         1399         3.33
       1.287     0.750000         1500         4.00
       1.318     0.775000         1549         4.44
       1.354     0.800000         1599         5.00
       1.410     0.825000         1649         5.71
       1.503     0.850000         1699         6.67
       4.939     0.875000         1749         8.00
       5.479     0.887500         1774         8.89
      21.231     0.900000         1800        10.00
      21.311     0.912500         1824        11.43
      24.719     0.925000         1849        13.33
      25.247     0.937500         1877        16.00
      25.295     0.943750         1888        17.78
      40.991     0.950000         1914        20.00
      40.991     0.956250         1914        22.86
      41.023     0.962500         1942        26.67
      41.023     0.968750         1942        32.00
      41.023     0.971875         1942        35.56
      44.415     0.975000         1956        40.00
      44.415     0.978125         1956        45.71
      44.991     0.981250         1998        53.33
      44.991     1.000000         1998          inf
#[Mean    =        4.398, StdDeviation   =       10.320]
#[Max     =       44.960, Total count    =         1998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  195.00us
 75.000%  224.00us
 90.000%  266.00us
 99.000%   43.84ms
 99.900%   43.94ms
 99.990%   43.94ms
 99.999%   43.94ms
100.000%   43.94ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.131     0.000000            1         1.00
       0.161     0.100000          212         1.11
       0.170     0.200000          418         1.25
       0.177     0.300000          601         1.43
       0.186     0.400000          822         1.67
       0.195     0.500000         1023         2.00
       0.198     0.550000         1099         2.22
       0.203     0.600000         1218         2.50
       0.208     0.650000         1313         2.86
       0.215     0.700000         1411         3.33
       0.224     0.750000         1501         4.00
       0.230     0.775000         1555         4.44
       0.238     0.800000         1610         5.00
       0.243     0.825000         1652         5.71
       0.249     0.850000         1707         6.67
       0.257     0.875000         1749         8.00
       0.262     0.887500         1776         8.89
       0.266     0.900000         1800        10.00
       0.273     0.912500         1824        11.43
       0.281     0.925000         1849        13.33
       0.290     0.937500         1874        16.00
       0.297     0.943750         1886        17.78
      40.671     0.950000         1899        20.00
      40.767     0.956250         1916        22.86
      40.799     0.962500         1926        26.67
      40.863     0.968750         1942        32.00
      40.863     0.971875         1942        35.56
      43.679     0.975000         1949        40.00
      43.743     0.978125         1959        45.71
      43.775     0.981250         1964        53.33
      43.807     0.984375         1970        64.00
      43.807     0.985938         1970        71.11
      43.839     0.987500         1978        80.00
      43.839     0.989062         1978        91.43
      43.871     0.990625         1986       106.67
      43.871     0.992188         1986       128.00
      43.871     0.992969         1986       142.22
      43.871     0.993750         1986       160.00
      43.903     0.994531         1991       182.86
      43.903     0.995313         1991       213.33
      43.903     0.996094         1991       256.00
      43.903     0.996484         1991       284.44
      43.935     0.996875         1998       320.00
      43.935     1.000000         1998          inf
#[Mean    =        2.377, StdDeviation   =        9.340]
#[Max     =       43.904, Total count    =         1998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3001 requests in 30.00s, 477.84KB read
Requests/sec:    100.02
Transfer/sec:     15.93KB